sugarcrm/src/main/resources/sugarcrm_entry/setEntry.xml

<template name="setEntry" xmlns="http://ws.apache.org/ns/synapse">

	<!-- Fields required by the method -->
	<parameter name="moduleName" description="The name of the module from which to retrieve records" />
	<parameter name="nameValueList" description="The name/value list of the record attributes" />

	<sequence>

		<property name="uri.var.moduleName" expression="$func:moduleName" />
		<property name="uri.var.nameValueList" expression="$func:nameValueList" />

		<payloadFactory>

			<format>
				<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="http://www.sugarcrm.com/sugarcrm"
					xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">

					<soapenv:Header />
					<soapenv:Body>
						<sug:set_entry>
							<sug:session>$1</sug:session>
							<sug:module_name>$2</sug:module_name>
							$3							
						</sug:set_entry>
					</soapenv:Body>

				</soapenv:Envelope>
			</format>

			<args>
				<arg expression="get-property('uri.var.session')" />
				<arg expression="get-property('uri.var.moduleName')" />
				<arg expression="get-property('uri.var.nameValueList')" />
			</args>

		</payloadFactory>
		
		<xslt key="SugerCRM_Converter_setEntry.xslt"/>
		
		<header name="To" expression="get-property('uri.var.sugarCRMurl')" />

		<call>
			<endpoint name="templEPTimeout" template="org.wso2.carbon.connector.sugarcrm.timeout">
				<parameter name="timoutDuration" value="6000" />
				<parameter name="initialDuration" value="2000" />
				<parameter name="progressAFactor" value="2.0" />
				<parameter name="maximumDuration" value="3000" />
			</endpoint>
		</call>

		<!-- Remove response custom header information -->
		<header name="X-SOAP-Server" scope="transport" action="remove" />
		<header name="Cache-control" scope="transport" action="remove" />
		<header name="Vary" scope="transport" action="remove" />
		<header name="Expires" scope="transport" action="remove" />
		<header name="Set-Cookie" scope="transport" action="remove" />
		<header name="path" scope="transport" action="remove" />
	</sequence>

</template>